#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
aws_iam_policy.AmazonEKSS3CSIDriverPolicy: Refreshing state... [id=arn:aws:iam::318374019075:policy/earth-dev-AmazonEKSS3CSIDriverPolicy]
aws_eip.eip_01: Refreshing state... [id=eipalloc-039c0b936692291e4]
aws_iam_policy.AWSLoadBalancerControllerIAMPolicy: Refreshing state... [id=arn:aws:iam::318374019075:policy/earth-dev-AWSLoadBalancerControllerIAMPolicy]
aws_eip.eip_02: Refreshing state... [id=eipalloc-06a4214633096af70]
aws_iam_role.AmazonEKSNodeGroupRole: Refreshing state... [id=earth-dev-AmazonEKSNodeGroupRole]
data.aws_iam_policy_document.AmazonEKSClusterAssumeRolePolicy: Reading...
aws_vpc.vpc: Refreshing state... [id=vpc-0a2c49393bb8be645]
data.aws_iam_policy_document.AmazonEKSClusterAssumeRolePolicy: Read complete after 0s [id=3552664922]
aws_iam_role.AmazonEKSClusterRole: Refreshing state... [id=earth-dev-AmazonEKSClusterRole]
aws_iam_role_policy_attachment.AmazonEKSClusterPolicy: Refreshing state... [id=earth-dev-AmazonEKSClusterRole-20231213112953014400000001]
aws_iam_role_policy_attachment.AmazonEKSVPCResourceController: Refreshing state... [id=earth-dev-AmazonEKSClusterRole-20231213112953024500000002]
aws_iam_role_policy_attachment.AmazonEKSWorkerNodePolicy: Refreshing state... [id=earth-dev-AmazonEKSNodeGroupRole-20231213112953032100000003]
aws_iam_role_policy_attachment.AmazonEC2ContainerRegistryReadOnly: Refreshing state... [id=earth-dev-AmazonEKSNodeGroupRole-20231213112953039000000004]
aws_security_group.cluster_sg: Refreshing state... [id=sg-0447aeb393bb39e54]
aws_internet_gateway.internet_gateway: Refreshing state... [id=igw-0c1ce7cc05e7887a3]
aws_security_group.allnodes-sg: Refreshing state... [id=sg-0cbd158d0b16fb2c1]
aws_subnet.public_subnet_02: Refreshing state... [id=subnet-049f53533977c532a]
aws_subnet.private_subnet_02: Refreshing state... [id=subnet-01129c85e0a8fad50]
aws_subnet.private_subnet_01: Refreshing state... [id=subnet-05eadd78baaaae671]
aws_subnet.public_subnet_01: Refreshing state... [id=subnet-0c8e4e6a47315b37c]
aws_route_table.public_route_table: Refreshing state... [id=rtb-06cb2bbd32c77f774]
aws_nat_gateway.nat_gateway_01: Refreshing state... [id=nat-0bf6bbdc9599cae72]
aws_nat_gateway.nat_gateway_02: Refreshing state... [id=nat-000fe75c61a5517f2]
aws_eks_cluster.eks_cluster: Refreshing state... [id=earth-dev]
aws_route_table.private_route_table_01: Refreshing state... [id=rtb-06c1b722fcbfe73b8]
aws_route_table.private_route_table_02: Refreshing state... [id=rtb-0d33b6eb7bf34fce7]
aws_route_table_association.route_table_association_p02: Refreshing state... [id=rtbassoc-0138ef88d847af82c]
aws_route_table_association.route_table_association_p01: Refreshing state... [id=rtbassoc-012afa25187f7712c]
aws_route_table_association.route_table_association_i02: Refreshing state... [id=rtbassoc-0fa973cec998c8b8a]
aws_route_table_association.route_table_association_i01: Refreshing state... [id=rtbassoc-0b61fb239cf57d761]
aws_eks_identity_provider_config.oidc: Refreshing state... [id=earth-dev:earth-dev]
data.tls_certificate.eks_cluster: Reading...
aws_eks_addon.kube_proxy: Refreshing state... [id=earth-dev:kube-proxy]
aws_launch_template.app_node: Refreshing state... [id=lt-03b53a5cae1f40b46]
aws_eks_node_group.app_node_group: Refreshing state... [id=earth-dev:app-node-group]
data.tls_certificate.eks_cluster: Read complete after 1s [id=d516f34410b983ad338645e4e1cb5bbfcdf5079b]
aws_iam_openid_connect_provider.eks_cluster: Refreshing state... [id=arn:aws:iam::318374019075:oidc-provider/oidc.eks.ap-northeast-2.amazonaws.com/id/5E06975C29635BF3F59C67DA27857351]
data.aws_iam_policy_document.AmazonEKSS3CSIDriverAssumeRolePolicy: Reading...
data.aws_iam_policy_document.AmazonEKSVPCCNIAssumeRolePolicy: Reading...
data.aws_iam_policy_document.AmazonEKSLoadBalancerControllerAssumeRolePolicy: Reading...
data.aws_iam_policy_document.AmazonEKSEBSCSIDriverAssumeRolePolicy: Reading...
data.aws_iam_policy_document.AmazonEKSEBSCSIDriverAssumeRolePolicy: Read complete after 0s [id=915887710]
data.aws_iam_policy_document.AmazonEKSLoadBalancerControllerAssumeRolePolicy: Read complete after 0s [id=3182224767]
data.aws_iam_policy_document.AmazonEKSVPCCNIAssumeRolePolicy: Read complete after 0s [id=3419001429]
data.aws_iam_policy_document.AmazonEKSS3CSIDriverAssumeRolePolicy: Read complete after 0s [id=716524240]
aws_iam_role.AmazonEKSEBSCSIDriverRole: Refreshing state... [id=earth-dev-AmazonEKSEBSCSIDriverRole]
aws_iam_role.AmazonEKSVPCCNIRole: Refreshing state... [id=earth-dev-AmazonEKSVPCCNIRole]
aws_iam_role.AmazonEKSS3CSIDriverRole: Refreshing state... [id=earth-dev-AmazonEKSS3CSIDriverRole]
aws_iam_role.AmazonEKSLoadBalancerControllerRole: Refreshing state... [id=earth-dev-AmazonEKSLoadBalancerControllerRole]
aws_eks_addon.coredns: Refreshing state... [id=earth-dev:coredns]
aws_iam_role_policy_attachment.AmazonEBSCSIDriverPolicy: Refreshing state... [id=earth-dev-AmazonEKSEBSCSIDriverRole-2023121311363991480000000e]
aws_eks_addon.aws_ebs_csi_driver: Refreshing state... [id=earth-dev:aws-ebs-csi-driver]
aws_iam_role_policy_attachment.AWSLoadBalancerControllerIAMPolicy: Refreshing state... [id=earth-dev-AmazonEKSLoadBalancerControllerRole-20231213113639935100000010]
aws_iam_role_policy_attachment.AmazonEKS_CNI_Policy: Refreshing state... [id=earth-dev-AmazonEKSVPCCNIRole-2023121311363993200000000f]
aws_eks_addon.vpc_cni: Refreshing state... [id=earth-dev:vpc-cni]
aws_iam_role_policy_attachment.AmazonEKSS3CSIDriverPolicy: Refreshing state... [id=earth-dev-AmazonEKSS3CSIDriverRole-2023121311363987040000000c]
aws_eks_addon.aws-mountpoint-s3-csi-driver: Refreshing state... [id=earth-dev:aws-mountpoint-s3-csi-driver]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_eks_addon.aws-mountpoint-s3-csi-driver is tainted, so must be replaced
-/+ resource "aws_eks_addon" "aws-mountpoint-s3-csi-driver" {
      ~ arn                         = "arn:aws:eks:ap-northeast-2:318374019075:addon/earth-dev/aws-mountpoint-s3-csi-driver/d0c6317c-9636-8e0b-b192-ee0c6ce5fe63" -> (known after apply)
      + configuration_values        = (known after apply)
      ~ created_at                  = "2023-12-13T11:39:06Z" -> (known after apply)
      ~ id                          = "earth-dev:aws-mountpoint-s3-csi-driver" -> (known after apply)
      ~ modified_at                 = "2023-12-13T11:39:06Z" -> (known after apply)
      - tags                        = {} -> null
        # (7 unchanged attributes hidden)
    }

  # aws_eks_addon.aws_ebs_csi_driver is tainted, so must be replaced
-/+ resource "aws_eks_addon" "aws_ebs_csi_driver" {
      ~ arn                         = "arn:aws:eks:ap-northeast-2:318374019075:addon/earth-dev/aws-ebs-csi-driver/54c6317c-963a-b802-55a3-17991094b097" -> (known after apply)
      + configuration_values        = (known after apply)
      ~ created_at                  = "2023-12-13T11:39:06Z" -> (known after apply)
      ~ id                          = "earth-dev:aws-ebs-csi-driver" -> (known after apply)
      ~ modified_at                 = "2023-12-13T11:39:06Z" -> (known after apply)
      + service_account_role_arn    = "arn:aws:iam::318374019075:role/earth-dev-AmazonEKSEBSCSIDriverRole"
      - tags                        = {} -> null
        # (7 unchanged attributes hidden)
    }

  # aws_eks_addon.coredns is tainted, so must be replaced
-/+ resource "aws_eks_addon" "coredns" {
      ~ arn                         = "arn:aws:eks:ap-northeast-2:318374019075:addon/earth-dev/coredns/1ec6317c-9634-00b1-bbcd-92a96c967da9" -> (known after apply)
      + configuration_values        = (known after apply)
      ~ created_at                  = "2023-12-13T11:39:06Z" -> (known after apply)
      ~ id                          = "earth-dev:coredns" -> (known after apply)
      ~ modified_at                 = "2023-12-13T11:39:06Z" -> (known after apply)
      - tags                        = {} -> null
        # (7 unchanged attributes hidden)
    }

  # aws_eks_addon.vpc_cni will be updated in-place
  ~ resource "aws_eks_addon" "vpc_cni" {
        id                          = "earth-dev:vpc-cni"
      + service_account_role_arn    = "arn:aws:iam::318374019075:role/earth-dev-AmazonEKSVPCCNIRole"
        tags                        = {}
        # (10 unchanged attributes hidden)
    }

Plan: 3 to add, 1 to change, 3 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @jonghak-dev, Action: `pull_request`, Workflow: `Terraform apply`*